amoghkshirsagar/arduinoLearning/atmega328p-MG90SmicroServo/MG90SmicroServo.h
// Red = 5V, Brm = Gnd, Orn = COntrolor PWM
//  see if it can move otherway also. It will not work with -ve values of Degrees
//  90 deg mid vale is 1350. 0 deg is 1350. 180 deg is 2300. Test

// servo.attach() - assign arduino pin connected to PWM pin of servo
// servo.datach() - opposite of above?
// servo.write(angle) - move servo to given angle
// servo.writeMicroseconds(us)- 1000 is fully CCW. 1500 is middle. 2000 is fully CW

// The original library is used is: https://github.com/arduino-libraries/Servo

/*
  Servo.h - Interrupt driven Servo library for Arduino using 16 bit timers - Version 2
  Copyright (c) 2009 Michael Margolis. All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

/*
  A servo is activated by creating an instance of the Servo class passing
  the desired pin to the attach() method.
  The servos are pulsed in the background using the value most recently
  written using the write() method.

  Note that analogWrite of PWM on pins associated with the timer are
  disabled when the first servo is attached.
  Timers are seized as needed in groups of 12 servos - 24 servos use two
  timers, 48 servos will use four.
  The sequence used to seize timers is defined in timers.h

  The methods are:

    Servo - Class for manipulating servo motors connected to Arduino pins.

    attach(pin ) - Attaches a servo motor to an I/O pin.
    attach(pin, min, max  ) - Attaches to a pin setting min and max values in microseconds
    default min is 544, max is 2400

    write()     - Sets the servo angle in degrees. (invalid angle that is valid as pulse in microseconds is treated as microseconds)
    writeMicroseconds() - Sets the servo pulse width in microseconds
    read()      - Gets the last written servo pulse width as an angle between 0 and 180.
    readMicroseconds()   - Gets the last written servo pulse width in microseconds. (was read_us() in first release)
    attached()  - Returns true if there is a servo attached.
    detach()    - Stops an attached servos from pulsing its I/O pin.
 */

#ifndef Servo_h
#define Servo_h

#include <inttypes.h>

/*
 * Defines for 16 bit timers used with Servo library
 *
 * If _useTimerX is defined then TimerX is a 16 bit timer on the current board
 * timer16_Sequence_t enumerates the sequence that the timers should be allocated
 * _Nbr_16timers indicates how many 16 bit timers are available.
 */

// Architecture specific include
#if defined(ARDUINO_ARCH_AVR)
#include "avr/ServoTimers.h"
#elif defined(ARDUINO_ARCH_SAM)
#include "sam/ServoTimers.h"
#elif defined(ARDUINO_ARCH_SAMD)
#include "samd/ServoTimers.h"
#elif defined(ARDUINO_ARCH_STM32F4)
#include "stm32f4/ServoTimers.h"
#elif defined(ARDUINO_ARCH_NRF52)
#include "nrf52/ServoTimers.h"
#elif defined(ARDUINO_ARCH_MEGAAVR)
#include "megaavr/ServoTimers.h"
#elif defined(ARDUINO_ARCH_MBED)
#include "mbed/ServoTimers.h"
#elif defined(ARDUINO_ARCH_RENESAS)
#include "renesas/ServoTimers.h"
#elif defined(ARDUINO_ARCH_XMC)
#include "xmc/ServoTimers.h"
#else
#error "This library only supports boards with an AVR, SAM, SAMD, NRF52, STM32F4, Renesas or XMC processor."
#endif

#define Servo_VERSION 2 // software version of this library

#define MIN_PULSE_WIDTH 544      // the shortest pulse sent to a servo
#define MAX_PULSE_WIDTH 2400     // the longest pulse sent to a servo
#define DEFAULT_PULSE_WIDTH 1500 // default pulse width when servo is attached
#define REFRESH_INTERVAL 20000   // minimum time to refresh servos in microseconds

#define SERVOS_PER_TIMER 12 // the maximum number of servos controlled by one timer
#define MAX_SERVOS (_Nbr_16timers * SERVOS_PER_TIMER)

#define INVALID_SERVO 255 // flag indicating an invalid servo index

#if !defined(ARDUINO_ARCH_STM32F4) && !defined(ARDUINO_ARCH_XMC)

typedef struct
{
    uint8_t nbr : 6;      // a pin number from 0 to 63
    uint8_t isActive : 1; // true if this channel is enabled, pin not pulsed if false
} ServoPin_t;

typedef struct
{
    ServoPin_t Pin;
    volatile unsigned int ticks;
} servo_t;

class Servo
{
public:
    Servo();
    uint8_t attach(int pin);                   // attach the given pin to the next free channel, sets pinMode, returns channel number or INVALID_SERVO if failure
    uint8_t attach(int pin, int min, int max); // as above but also sets min and max values for writes.
    void detach();
    void write(int value);             // if value is < 200 it's treated as an angle, otherwise as pulse width in microseconds
    void writeMicroseconds(int value); // Write pulse width in microseconds
    int read();                        // returns current pulse width as an angle between 0 and 180 degrees
    int readMicroseconds();            // returns current pulse width in microseconds for this servo (was read_us() in first release)
    bool attached();                   // return true if this servo is attached, otherwise false
private:
    uint8_t servoIndex; // index into the channel data for this servo
    int8_t min;         // minimum is this value times 4 added to MIN_PULSE_WIDTH
    int8_t max;         // maximum is this value times 4 added to MAX_PULSE_WIDTH
};

#endif
#endif

#include <Servo.h>
Servo servo;

Serial.begin(9600);
servo.attach(servoPin);

int trackingAngle = 0;
int ACLOCK_RUN_MS = 85;
int ACLOCK_PULSE = 1550;
int CLOCK_RUN_MS = 90;
int CLOCK_PULSE = 1450;
int STOP_PULSE = 1500;
int STOP_RUN_MS = 60;
int DEG_10 = 1;
int SIDE = 1;

void oscillate(int angle, int pauseDur)
{
    rotateClockwise(angle);
    pause(pauseDur);
    rotateAntiClockwise(angle);
    pause(pauseDur);
}

void rotateClockwise(int angle)
{
    rotate(angle, CLOCK_PULSE, CLOCK_RUN_MS);
}

void rotateAntiClockwise(int angle)
{
    rotate(angle, ACLOCK_PULSE, ACLOCK_RUN_MS);
}

void rotate(int angle, int pulse, int runMs)
{
    int pulseAngle = angle / 10;
    int totalDeg = DEG_10 * pulseAngle;
    for (int i = 0; i < totalDeg; i++)
    {
        servo.writeMicroseconds(pulse);
        delay(runMs);
        servo.writeMicroseconds(STOP_PULSE);
        delay(STOP_RUN_MS);
        if (trackingAngle >= angle)
        {
            SIDE = -1;
        }
        else if (trackingAngle <= 0)
        {
            SIDE = 1;
        }
        trackingAngle = trackingAngle + (pulseAngle * SIDE);
        Serial.print("Angle: ");
        Serial.println(trackingAngle);
    }
}

void pause(int duration)
{
    servo.writeMicroseconds(STOP_PULSE);
    delay(duration);
}